Revit 2024 API
HardwoodTintEnabledType Enumeration
 The enumerated type representing the permitted values for the asset property "HardwoodTintEnabled" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum HardwoodTintEnabledType
Visual Basic
Public Enumeration HardwoodTintEnabledType
Visual C++
public enum class HardwoodTintEnabledType
Members
Member name | Description
NoColor
ColorChoice
See Also
Autodesk.Revit.DB.Visual Namespace